RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/header/S32K344.h
**                                      -FRENTC register is added.            
**                                      14)MDM_AP-                            
**                                      -MDMAPCTL register- POR_WDG_DIS       
**                                       bitfield is added.                   
**                                      -CM7_0_CORE_ACCESS and                
**                                       CM7_1_CORE_ACCESS bitfields are      
**                                       removed.                             
**                                      15)MSCM-                              
**                                      -ENEDC register- ENET bitfield is     
**                                       changed to EMAC.                    
**                                      -IAHBCFGREG register- ENET_DIS_WR_OPT 
**                                       is renamed as EMAC_DIS_WR_OPT.       
**                                      16)PFLASH-        
**                                      -PFLASH_D_PFCBLKI_SSPELOCK_COUNT is removed.
**                                      -PFLASH_D_PFCBLKI_SSETSLOCK_COUNT is removed.   
**                                      -PFLASH_PFCBLKI_LOCKMASTER_SS_PFCBLKI_LOCKMASTER_SSJ_COUNT
**                                       is added.
**                                      -PFLASH_PFCBLKI_LOCKMASTER_SS_COUNT is added.                 
**                                      -PFCDBLK_SSPELOCK register is removed.
**                                      -PFCDBLK_SSETSLOCK register is removed
**                                      -PFCBLKx_LOCKMASTER_SSx registers are 
**                                       converted into array.                
**                                      17)Peripheral_Debug_Freeze module is  
**                                      removed.                              
**                                      18)QuadSPI-                           
**                                      -DLLCRA register- SLV_DLY_FINE        
**                                       bitfield is removed.                   
**                                      19)SIUL2-       
**                                      -SIUL2_IMCR_COUNT's value is changed  
**                                       from 409 to 379.                                         
**                                      -MIDR1 register- CC_REVISION bitfield 
**                                       is removed.                          
**                                      -MIDR3 register- SYS_RAM_SIZE,        
**                                       PART_NO_SUF, PROD_FAM_NO and         
**                                       PROD_FAM_LET bitfields are added.    
**                                      -MIDR4 register- CORE_PLAT_FET,       
**                                       EMAC_FET and SEC_FET bitfields are   
**                                       added.                                
**                                      20)STCU-                              
**                                      CTRL register- PFT bitfield is     
**                                      removed.                               
**                                      21)XRDC-                              
**                                      XRDC_PDAC_SLOT_PDACN_COUNT's value is
**                                      changed from 111 to 109.
**
**     -1.5 Taru Shree 11-Nov-20        1)Initial release based on            
**                                      RM Rev.2. Draft A.    
**                                      2)ADC-
**                                      -ICDR registers are merged into single 
**                                       array.
**                                      -AMSIO and CAL_2 registers are added.
**                                      3)DCM-
**                                      -DCMSTAT register- 
**                                       -DCMERR and DCMUTS bitfields are added.
**                                       -DCMOTAA and DCMOTAR bitfields are removed.
**                                      -DCMMISC register-
**                                       DCMDBGE bitfield is added.
**                                      4)LPI2C-
**                                      SIER register- AM1F bitfield is renamed as 
**                                      AM1IE.
**   
**     -1.6 Taru Shree 02-March-20      1)Initial release based on            
**                                      RM Rev.2. Draft B.    
**                                      2)Following interrupt names are
**                                      changed-
**                                      -From HSE_B_0_IRQn to HSE_MU0_TX_IRQn.
**                                      -From HSE_B_1_IRQn to HSE_MU0_RX_IRQn.
**                                      -From HSE_B_2_IRQn to HSE_MU0_ORED_IRQn.
**                                      -From HSE_B_3_IRQn to HSE_MU1_TX_IRQn.
**                                      -From HSE_B_4_IRQn to HSE_MU1_RX_IRQn.
**                                      -From HSE_B_5_IRQn to HSE_MU1_ORED_IRQn. 
**                                      3)FLASH-
**                                      -ADATA register array is removed.
**                                      -AMCR, AMCRS, APEADR,ASPELOCK
**                                       and ASSPELOCK registers are 
**                                       removed.
**                                      4)FLASH_ALT instance is removed.
**                                      5)MDM_AP register-
**                                      -MDMAPSTTS register-
**                                       HSEHLT, HSEBPDPSLP, HSEBSLPNG
**                                       and CM0PDBGRST bitfields are 
**                                       removed.
**                                      -MDMAPCTL register-
**                                       HSEBDBGREQ and CM0PDBGRSRT
**                                       bitfields are removed.
**                                      6)MSCM-
**                                      -ENEDC register-
**                                       -CM7_0_AHBM bitfield name is
**                                        changed to EN_RD_CM7_0_AHBM.
**                                       -CM7_0_AHBP bitfield name is
**                                        changed to EN_RD_CM7_0_AHBP.
**                                       -eDMA bitfield name is changed
**                                        to EN_RD_EDMA.
**                                       -HSE bitfield name is changed to
**                                        EN_RD_HSE.
**                                       -EMAC bitfield name is changed to
**                                        EN_RD_EMAC.
**                                       -CM7_1_AHBM bitfield name is changed
**                                        to EN_RD_CM7_1_AHBM.    
**                                       -CM7_1_AHBP bitfield name is changed
**                                        to EN_RD_CM7_1_AHBP.   
**                                       -TCM bitfield name is changed
**                                        to EN_RD_TCM. 
**                                       -P_FLASH_PORT0 bitfield name is changed
**                                        to EN_ADD_PFLASH_PORT0.   
**                                       -P_FLASH_PORT1 bitfield name is changed
**                                        to EN_ADD_PFLASH_PORT1.  
**                                       -P_FLASH_PORT2 bitfield name is changed
**                                        to EN_ADD_PFLASH_PORT2.     
**                                       -EN_PRAM0 bitfield name is changed
**                                        to EN_WR_PRAM0.     
**                                       -PRAM0 bitfield name is changed
**                                        to EN_ADD_PRAM0.     
**                                       -EN_PRAM1 bitfield name is changed
**                                        to EN_WR_PRAM1.     
**                                       -EN_PRAM1 bitfield name is changed
**                                        to EN_WR_PRAM1. 
**                                       -EN_TCM bitfield name is changed
**                                        to EN_WR_TCM.  
**                                       -ADD_TCM bitfield name is changed
**                                        to EN_ADD_TCM.  
**                                       -EN_AIPS0 bitfield name is changed
**                                        to EN_WR_AIPS0.  
**                                       -EN_AIPS1 bitfield name is changed
**                                        to EN_WR_AIPS1.  
**                                       -EN_AIPS2 bitfield name is changed
**                                        to EN_WR_AIPS2. 
**                                       -CM7_0_TCM bitfield name is changed
**                                        to EN_WR_CM7_0_TCM.  
**                                       -ADD_CM7_0_TCM bitfield name is changed
**                                        to EN_ADD_CM7_0_TCM.   
**                                       -CM7_1_TCM bitfield name is changed
**                                        to EN_WR_CM7_1_TCM.   
**                                       -ADD_CM7_1_TCM bitfield name is changed
**                                        to EN_ADD_CM7_1_TCM.   
**                                      7)PFLASH-
**                                      -PFCPGM_APEADR_L and PFCPGM_APEADR_P 
**                                       registers are removed. 
**                                      8)PFLASH_ALT instance is removed.
**                                      9)SAI-
**                                      -TCR2 register-
**                                       BCS bitfield is removed.
**                                      -RCR2 register-
**                                       BCS bitfield is removed.
**                                      10)VIRT_WRAPPER-
**                                      -Following register array names
**                                       are changed-
**                                       -From REG to REG_A.
**                                       -From REG_32 to REG_B.
**                                       -From REG_64 to REG_C.
**                                       -From REG_65 to REG_D.
**
**     -1.7 Taru Shree 16-Aug-21      1)Initial release based on            
**                                      RM Rev.2.
**                                    2)SoC_PLL interrupt is added.
**                                    3)ADC-                                
**                                    -PCDR registers are converted into    
**                                     array.                               
**                                    -AMSIO register: HSEN bitfield’s size 
**                                     changed from HSEN 1 to 2.            
**                                    4)DCM-                                
**                                    DCMMISC register: MRKLSTRCHK bitfield 
**                                    is removed.                           
**                                    5)DCM_GPR-                            
**                                    -DCMROD3 register: CM7_1_LOCKUP,      
**                                     CM7_1_DCDATA_ECC_ERR,                
**                                     CM7_1_DCTAG_ECC_ERR and              
**                                     CM7_1_ICDATA_ECC_ERR bitfields are   
**                                     removed.                             
**                                    -DCMROD4 register:                    
**                                     CM7_1_ICTAG_ECC_ERR,                 
**                                     PF2_CODE_ECC_ERR, PF2_DATA_ECC_ERR   
**                                     and FLASH_ECC_ERR bitfields are      
**                                     removed.                             
**                                    -DCMROD5 register:                    
**                                     CM7_1_AHBP_RDATA_EDC_ERR and         
**                                     CM7_1_AHBM_RDATA_EDC_ERR bitfields   
**                                     are removed.                         
**                                    -DCMROF20 register: CM7_TCM_WS_EN     
**                                     bitfield is removed.                 
**                                    -DCMRWD3 register: CM7_1_LOCKUP_EN,   
**                                     CM7_1_DCDATA_ECC_ERR_EN,             
**                                     CM7_1_DCTAG_ECC_ERR_EN and           
**                                     CM7_1_ICDATA_ECC_ERR_EN bitfields are
**                                     removed.                             
**                                    -DCMRWD4 register:                    
**                                     CM7_1_ICTAG_ECC_ERR_EN,              
**                                     PF2_CODE_ECC_ERR_EN,                 
**                                     PF2_DATA_ECC_ERR_EN and              
**                                     FLASH_ECC_ERR_EN bitfields are       
**                                     removed.                             
**                                    -DCMRWD5 register:                    
**                                     CM7_1_AHBP_RDATA_EDC_ERR_EN and      
**                                     CM7_1_AHBM_RDATA_EDC_ERR_EN bitfields
**                                     are removed.                         
**                                    -DCMRWD7 register: All bitfields are  
**                                     removed.                             
**                                    -DCMRWD8 register: All bitfields are  
**                                     removed.                             
**                                    -DCMRWD9 register: All bitfields are  
**                                     removed.                             
**                                    -DCMRWF4 register: CM7_1_CPUWAIT      
**                                     bitfield is removed.                 
**                                    6)EMAC-                               
**                                    Following registers are added:
**                                    -MAC_VLAN_TAG
**                                    -MAC_VLAN_TAG_FILTER0
**                                    -MAC_VLAN_TAG_FILTER1
**                                    -MAC_VLAN_TAG_FILTER2
**                                    -MAC_VLAN_TAG_FILTER3                 
**                                    7)LPI2C-                              
**                                    SRDR register: RADDR bitfield is added
**                                    8)XRDC-                               
**                                    PID register: LMNUM and ELK22H        
**                                    bitfields are removed.                
**
**     -1.8 Taru Shree 08-Sep-21      1)Updated the Header file for        
**                                    RM Rev.2.
**                                    2)AXBS_LITE-
**                                    -PRS0 register: M4 bitfield is removed.
**                                     CRS0 register: HPE4 bitfield is 
**                                     removed.
**                                    -PRS1 register: M4 bitfield is 
**                                     removed.
**                                    -CRS1 register: HPE4 bitfield is 
**                                     removed.
**                                    -PRS2 register: M4 bitfield is 
**                                     removed.
**                                    -CRS2 register: HPE4 bitfield is 
**                                     removed.
**                                    -PRS3 register: M4 bitfield is 
**                                     removed.
**                                    -CRS3 register: HPE4 bitfield is 
**                                     removed.
**                                    -PRS4 register: M4 bitfield is 
**                                     removed.
**                                    -CRS4 register: HPE4 bitfield is 
**                                     removed.
**                                    -PRS5 register: M4 bitfield is 
**                                     removed.
**                                    -CRS5 register: HPE4 bitfield is 
**                                     removed.
**                                    -PRS6 register: M4 bitfield is 
**                                     removed.
**                                    -CRS6 register: HPE4 bitfield is 
**                                     removed.
**                                    3)MC_ME-
**                                    -PRTN0_CORE1_PCONF, PRTN0_CORE1_PUPD, 
**                                     PRTN0_CORE1_STAT and PRTN0_CORE1_ADDR 
**                                     registers are removed.
**                                    -PRTN2_COFB0_STAT register: BLOCK27 
**                                     bitfield is removed.
**                                    -PRTN2_COFB0_CLKEN register: REQ27 
**                                     bitfield is removed.
**                                    4)MC_RGM-
**                                    -FES register: SWT1_RST bitfield is 
**                                     removed.
**                                    -FERD register: D_SWT1_RST bitfield 
**                                     is removed.
**                                    -FBRE register: BE_SWT1_RST bitfield 
**                                     is removed.
**                                    5)MDM_AP-
**                                    -MDMAPSTTS register: CM71HLT, CM71DPSLP, 
**                                     CM71SLPNG and CM71DBGRSTRD bitfields 
**                                     are removed.
**                                    -MDMAPCTL register: CM71DBGREQ and CM71DBGRSRT 
**                                     bitfields are removed.
**                                    6)MSCM-
**                                    -CP1TYPE, CP1NUM, CP1REV, CP1CFG0, CP1CFG1, 
**                                     CP1CFG2 and CP1CFG3 registers are removed.
**                                    -IRCP0ISR0 register: CP1_INT bitfield is removed.
**                                    -IRCP0ISR1 register: CP1_INT bitfield is removed.
**                                    -IRCP0ISR2 register: CP1_INT bitfield is removed.
**                                    -IRCP0ISR3 register: CP1_INT bitfield is removed.
**                                    -IRCP1ISR0 register: CP1_INT bitfield is removed.
**                                    -IRCP1ISR1 register: CP1_INT bitfield is removed.
**                                    -IRCP1ISR2 register: CP1_INT bitfield is removed.
**                                    -IRCP1ISR3 register: CP1_INT bitfield is removed.
**                                    -IRCPCFG register: CP1_TR bitfield is removed.
**                                    -IRSPRC register: M7_1 bitfield is removed.
**                                    7)PFLASH-
**                                    PFCR register array size is changed from 3 to 2.
**                                    8)SDA_AP-
**                                    SDAAPRSTCTRL register: RSTRELTLCM71 bitfield is 
**                                    removed.
**                                    9)XRDC-
**                                    -MDA_W0_4_DFMT0 register is removed.
**                                    -MDACFG’s Valid array indices are 0-3, 5.
**                                    -PID array size is changed from 5 to 4.
**                                    10)MCM_1_CM7, MU_2__MUA, MU_2__MUB and SWT_1 
**                                    instances are removed.
**
**     -1.9 Taru Shree 26-Oct-21      1)Initial release based on RM Rev.3.
**                                    2)EMAC-
**                                    MAC_VLAN_INCL register array with MAC_VLAN_INCL, 
**                                    MAC_VLAN_INCL0, MAC_VLAN_INCL1, MAC_VLAN_INCL2, 
**                                    MAC_VLAN_INCL3, MAC_VLAN_INCL4, MAC_VLAN_INCL5, 
**                                    MAC_VLAN_INCL6 and MAC_VLAN_INCL7 registers is 
**                                    added.
**                                    3)XBIC_PERI and XBIC_EDMA instances positions 
**                                    are interchanged.
** ###################################################################
*/

/*!
 * @file S32K344.h
 * @version 1.9
 * @date 2021-10-27
 * @brief Peripheral Access Layer for S32K344
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/* Prevention from multiple including the same memory map */
#if !defined(S32K344_H_)  /* Check if memory map has not been already included */
#define S32K344_H_

/* ----------------------------------------------------------------------------
   -- IP Header Files
   ---------------------------------------------------------------------------- */

/* IP Header Files List */
#include "S32K344_ADC.h"
#include "S32K344_AXBS_LITE.h"
#include "S32K344_BCTU.h"
#include "S32K344_CMU_FC.h"
#include "S32K344_CMU_FM.h"
#include "S32K344_CONFIGURATION_GPR.h"
#include "S32K344_CRC.h"
#include "S32K344_DCM.h"
#include "S32K344_DCM_GPR.h"
#include "S32K344_DMA.h"
#include "S32K344_DMAMUX.h"
#include "S32K344_DMA_TCD.h"
#include "S32K344_EIM.h"
#include "S32K344_EMAC.h"
#include "S32K344_EMIOS.h"
#include "S32K344_ERM.h"
#include "S32K344_FCCU.h"
#include "S32K344_FIRC.h"
#include "S32K344_FLASH.h"
#include "S32K344_FLEXCAN.h"
#include "S32K344_FLEXIO.h"
#include "S32K344_FXOSC.h"
#include "S32K344_INTM.h"
#include "S32K344_JDC.h"
#include "S32K344_LCU.h"
#include "S32K344_LPCMP.h"
#include "S32K344_LPI2C.h"
#include "S32K344_LPSPI.h"
#include "S32K344_LPUART.h"
#include "S32K344_MCM_CM7.h"
#include "S32K344_MC_CGM.h"
#include "S32K344_MC_ME.h"
#include "S32K344_MC_RGM.h"
#include "S32K344_MDM_AP.h"
#include "S32K344_MSCM.h"
#include "S32K344_MU.h"
#include "S32K344_PFLASH.h"
#include "S32K344_PIT.h"
#include "S32K344_PLL.h"
#include "S32K344_PMC.h"
#include "S32K344_PRAMC.h"
#include "S32K344_QUADSPI.h"
#include "S32K344_QUADSPI_ARDB.h"
#include "S32K344_RTC.h"
#include "S32K344_SAI.h"
#include "S32K344_SDA_AP.h"
#include "S32K344_SELFTEST_GPR.h"
#include "S32K344_SEMA42.h"
#include "S32K344_SIRC.h"
#include "S32K344_SIUL2.h"
#include "S32K344_STCU.h"
#include "S32K344_STM.h"
#include "S32K344_SWT.h"
#include "S32K344_SXOSC.h"
#include "S32K344_TEMPSENSE.h"
#include "S32K344_TRGMUX.h"
#include "S32K344_TSPC.h"
#include "S32K344_VIRT_WRAPPER.h"
#include "S32K344_WKPU.h"
#include "S32K344_XBIC.h"
#include "S32K344_XRDC.h"
#include "S32K344_NVIC.h"
#include "S32K344_SCB.h"
#include "S32K344_SYSTICK.h"
#include "S32K344_MPU.h"

#endif  /* #if !defined(S32K344_H_) */
